app/controllers/coords_controller.rb

SELECT * FROM `coords`
---
  def index
    @coords = Coord.all

SELECT * FROM `coords` WHERE (`coords`.`id` = 1)
---
  def show
    @coord = Coord.find(params[:id])

SELECT * FROM `coords` WHERE (`coords`.`id` = 1)
---
  def edit
    @coord = Coord.find(params[:id])

INSERT INTO `coords` (`x_utm`, `y_utm`, `latitude`, `longitude`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, NULL, '2009-08-19 21:24:16', '2009-08-19 21:24:16')
---
  def create
    @coord = Coord.new(params[:coord])
    if @coord.save